### 1. 라이브러리 정의

In [1]:
import pandas as pd

### 2. 파일 데이터 불러오기

#### - 상대경로, 절대경로
#### - 데이터불러오기(pandas ~ csv ~ sep 활용법 기억)
#### - 데이터 불러올 경우 한글 유의

In [2]:
Cardata = 'https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/cars.csv'

In [5]:
targetData = 'https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/cars.csv111'
aa = []
try :
    aa = pd.read_csv(targetData)
except Exception as e:
    print(e)
    print(targetData)
# 예외처리 사용

HTTP Error 404: Not Found
https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/cars.csv111

In [7]:
pd.read_csv('./currData.txt')

      aadd
0       bb
1       dd
2  123sdfs
3   dsfsdf

In [9]:
aa = pd.read_clipboard()
# 복사해 놓은 것 붙여넣기

In [10]:
aa

   aa  bb  cc  dd
0  11  22  33  44
1   7   6   5   5

In [11]:
bb = aa.rename(columns={"aa":"kk"})

In [12]:
bb

   kk  bb  cc  dd
0  11  22  33  44
1   7   6   5   5

### 데이터 저장

In [14]:
indata = pd.read_csv(Cardata)

In [16]:
indata.to_csv('./cardata1.csv', index = True)
# 현재 디렉터리 위치에 indata 파일을 index를 포함하여 cardata1이라는 이름으로 저장한다.

In [18]:
indata.to_csv('./cardata2.csv', index = False)
# 현재 디렉터리 위치에 indata 파일을 index를 제외하고 cardata1이라는 이름으로 저장한다.

In [20]:
data = pd.read_csv('../dataset/kopo_region_mst_hangul.csv')
# 한글 인코딩이 안되어서 글자가 깨진다.

UnicodeDecodeError: 'utf-8' codec can't decode byte 0xbe in position 0: invalid start byte

In [23]:
data = pd.read_csv('../dataset/kopo_region_mst_hangul.csv', encoding = "ms949")
data
# 정상정으로 출력된다.

   REGIONID REGIONNAME
0       A00       아프리카
1       A01         미국
2       A02         한국
3       A03         독일
4       A04        브라질
..      ...        ...
68      A68      베네수엘라
69      A69        베트남
70      A70       바누아투
71      A71        NaN
72      A99         기타

[73 rows x 2 columns]

In [26]:
data.columns = ['a','b']
data
# 컬럼명을 변경한다.

      a      b
0   A00   아프리카
1   A01     미국
2   A02     한국
3   A03     독일
4   A04    브라질
..  ...    ...
68  A68  베네수엘라
69  A69    베트남
70  A70   바누아투
71  A71    NaN
72  A99     기타

[73 rows x 2 columns]

In [31]:
data.rename (columns = {'a' : '1','b':'2'})
# 바뀐게 바뀐게 아니다. 다시 출력해보면 동일하다.
# 그래서 inplace를 사용해서 즉시 변경할 수 있다.(메모리를 최적화 하기위해서)

      1      2
0   A00   아프리카
1   A01     미국
2   A02     한국
3   A03     독일
4   A04    브라질
..  ...    ...
68  A68  베네수엘라
69  A69    베트남
70  A70   바누아투
71  A71    NaN
72  A99     기타

[73 rows x 2 columns]

In [32]:
data

      a      b
0   A00   아프리카
1   A01     미국
2   A02     한국
3   A03     독일
4   A04    브라질
..  ...    ...
68  A68  베네수엘라
69  A69    베트남
70  A70   바누아투
71  A71    NaN
72  A99     기타

[73 rows x 2 columns]

In [40]:
data.rename(columns = {'a':'1','b':'2'},inplace = True)
# 컬럼이름 즉시변경
print(renameData)

      1      2
0   A00   아프리카
1   A01     미국
2   A02     한국
3   A03     독일
4   A04    브라질
..  ...    ...
68  A68  베네수엘라
69  A69    베트남
70  A70   바누아투
71  A71    NaN
72  A99     기타

[73 rows x 2 columns]

In [44]:
renameData = data.rename(columns = {'1':'a','2':'b'})
print(renameData)
# 변수에 담아서 변경할 수도있다.

      a      b
0   A00   아프리카
1   A01     미국
2   A02     한국
3   A03     독일
4   A04    브라질
..  ...    ...
68  A68  베네수엘라
69  A69    베트남
70  A70   바누아투
71  A71    NaN
72  A99     기타

[73 rows x 2 columns]

### 다른 DB에 접속하여 작업

#### DB연동 패키지

In [45]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\smart-25\anaconda3\lib\site-packages (2.8.6)
Note: you may need to restart the kernel to use updated packages.

In [46]:
pip show sqlAlchemy

Name: SQLAlchemy
Version: 1.3.18
Summary: Database Abstraction Library
Home-page: http://www.sqlalchemy.org
Author: Mike Bayer
Author-email: mike_mp@zzzcomputing.com
License: MIT
Location: c:\users\smart-25\anaconda3\lib\site-packages
Requires:
Required-by:
Note: you may need to restart the kernel to use updated packages.

In [48]:
targetData = '../dataset/customer.csv'

In [51]:
Data = pd.read_csv(targetData, encoding = 'ms949')

#### 데이터 컬럼 소문자로 변경

In [56]:
Data.columns = ["weight","height","mark"]
# postgres에서는 소문자만을 사용하기때문에 컬럼을 소문자로 변경하여 준다.

#### 데이터 저장(postgres)

In [60]:
import psycopg2
from sqlalchemy import create_engine

In [61]:
localUrl = "postgresql://postgres:postgres@127.0.0.1:5432/postgres"
# 내컴퓨터 DB 커넥션 만들기

In [69]:
remoteUrl = "postgresql://postgres:postgres@192.168.110.9:5432/postgres"
# 23번 컴퓨터와 연결 DB 커넥션 만들기

In [102]:
engine_9 = create_engine(remoteUrl)
# 9번 컴(192.168.110.9)과 연결을 위한 엔진
engine_local = create_engine(localUrl)
# 내컴(127.0.0.1)에 연결을 위한 엔진
# DB 커넥션 열기
# 이 과정을 생략하고 url을 바로 연결해도 가능은하다.

In [71]:
resultTableName = "lkr1111_out"
# 보낼때 사용할 테이블 이름을 새로운 변수에 담았다.

In [72]:
# 예외처리(지금 몰라도됨)
try:
    to_sql(sss)
except Exception as e:
    print(e)
    
# 전송에 성공하든 안하든 엔진을 닫는다.   
engine_pg.dispose()

name 'to_sql' is not defined

In [73]:
data.to_sql(name = resultTableName, con=engine_pg,
                    if_exists="replace", index = False)
# data라는 변수에 담긴 csv파일을 resultTableName에 담긴 변수이름으로 보낸다.

In [74]:
pd.read_sql_table(table_name="jam_out", con = engine_pg)

  아이언맨   헐크   토르
0  김재민  최성운  이경률
1   치킨   피자   족발

In [75]:
engine_pg.table_names()
# 연결된 서버의 모든 테이블 목록을 보여준다.

['dd_out', 'bb', '09_out', 'lkr1111_out', 'jam_out', '0909_out', 'lkr_out']

In [80]:
indata = pd.read_sql_table(table_name="jam_out", con = engine_pg)
# 컬럼명 변경을 위해서 연결된 서버의 데이터베이스에서 lkr_out라는 테이블을 불러온다.

In [79]:
indata.columns
# 불러온 테이블의 모든 컬럼명을 보여준다.

Index(['아이언맨', '헐크', '토르'], dtype='object')

In [83]:
indata.columns = ['a','b','c']
indata

     a    b    c
0  김재민  최성운  이경률
1   치킨   피자   족발

In [84]:
indata.head(1)
# 불러온 테이블의 상위 한개 튜플만 보여준다

     a    b    c
0  김재민  최성운  이경률

### 23번 컴퓨터에서 테이블을 받아와서 내컴 서버에 저장

In [103]:
lee = pd.read_sql_table(table_name="jam_out", con = engine_9)
# 9번 db에 있는 jam_out이라는 테이블을 lee라는 변수에 담는다

In [104]:
lee.columns = ['superman','batman','spiderman']
# jam_out테이블의 컬럼명을 바꿔준다.

In [105]:
engine_pg = create_engine(localUrl)
# 엔진을 localUrl로 바꾸어 준다.

In [106]:
resultTableName = "leekyung"
# 저장할때 사용할 테이블의 이름을 정해준다.

In [108]:
lee.to_sql(name = resultTableName, con=engine_local,
                    if_exists="replace", index = False)
# 내컴에 연결하는 엔진을 이용해서 "leekyung"이라는 이름으로 lee테이블을 저장한다.